In [1]:
# DataWarehouse

In [2]:
import pandas as pd 
import numpy as np
import sqlite3
conn = sqlite3.connect('CourseDataWarehouse.db')
c = conn.cursor()

In [3]:
%load_ext sql

In [4]:
%%sql
sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [5]:
%%sql
DROP TABLE IF EXISTS COURSE;
DROP TABLE IF EXISTS MEETING;
DROP TABLE IF EXISTS LOCATION;
DROP TABLE IF EXISTS INSTRUCTOR;
DROP TABLE IF EXISTS PROGRAM;
DROP TABLE IF EXISTS CATALOG;
DROP TABLE IF EXISTS TIME;
DROP TABLE IF EXISTS CALCULATIONS;

 * sqlite:///CourseDataWarehouse.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

## Create DataWarehouse Tables ##

In [6]:
%%sql
--Creating Dimension Table: Catalog--
    
CREATE TABLE 'CATALOG' (
    CatClass INTEGER PRIMARY KEY,
    CatID VARCHAR,
    Title VARCHAR NOT NULL,
    Description TEXT,
    Credits TEXT NOT NULL,
    PREREQS TEXT,
    COREQS TEXT,
    FEES INTEGER,
    Attribute TEXT
    PID INTEGER,
    FOREIGN KEY (PID) REFERENCES Program(PID)
    
);

 * sqlite:///CourseDataWarehouse.db
(sqlite3.OperationalError) unknown column "PID" in foreign key definition [SQL: "--Creating Dimension Table: Catalog--\n    \nCREATE TABLE 'CATALOG' (\n    CatClass INTEGER PRIMARY KEY,\n    CatID VARCHAR,\n    Title VARCHAR NOT NULL,\n    Description TEXT,\n    Credits TEXT NOT NULL,\n    PREREQS TEXT,\n    COREQS TEXT,\n    FEES INTEGER,\n    Attribute TEXT\n    PID INTEGER,\n    FOREIGN KEY (PID) REFERENCES Program(PID)\n    \n);"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [7]:
%%sql
--Creating Dimension Table: Instructor--

CREATE TABLE 'INSTRUCTOR' (
    InID INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [8]:
%%sql
--Create Dimension Table: Location--
    
CREATE TABLE 'LOCATION' (
    LID INTEGER PRIMARY KEY,
    Location VARCHAR NOT NULL
    
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [9]:
%%sql
--Create Dimension Table: Program--
    
CREATE TABLE 'PROGRAM' (
    PID INTEGER NOT NULL PRIMARY KEY,
    PName TEXT,
    PCode VARCHAR
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [10]:
%%sql
--Creating Fact Table: Course-- 

CREATE TABLE 'COURSE' (
    SID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Section VARCHAR NOT NULL,
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    AvgCap INTEGER,
    MedCap INTEGER,
    CountCRN, INTEGER,
    CountLocation INTEGER, 
    InID INTEGER,
    CatID VARCHAR,
    PID INTEGER, 
    FOREIGN KEY (CatID) REFERENCES CATALOG(CatID),
    FOREIGN KEY (InID) REFERENCES INSTRUCTOR(InID),
    FOREIGN KEY (PID) REFERENCES Program(PID)
    
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [11]:
%%sql
--Creating Fact Table: Meeting--
    
CREATE TABLE 'MEETING' (
    MID INTEGER NOT NULL PRIMARY KEY, 
    Term TEXT NOT NULL,
    CRN INTEGER NOT NULL,
    Location VARCHAR,
    Start,
    End,
    Day,
    CountLocation INTEGER,
    FOREIGN KEY (Location) REFERENCES LOCATION(Location)
    
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [12]:
%%sql
sqlite:///CourseData2.db

'Connected: @CourseData2.db'

In [13]:
conn2 = sqlite3.connect('CourseData2.db')
c2 = conn.cursor()

## Create Dataframes ##

In [14]:
course = 'SELECT * FROM SECTION;'
df = pd.read_sql(course, conn2)
df.head()

   SID    CRN      Term Section  Cap  Act  Rem    CatID  InID
0    1  70384  Fall2014     C01    0   31  -31  AC 0011     1
1    2  70385  Fall2014     C02    0   31  -31  AC 0011     1
2    3  70382  Fall2014     C03    0   31  -31  AC 0011     1
3    4  70291  Fall2014     C04    0   29  -29  AC 0011     2
4    5  70350  Fall2014     C05    0   30  -30  AC 0011     2

In [15]:
catalog = 'SELECT * FROM CATALOG;'
df2 = pd.read_sql(catalog, conn2)
df2.head()

,CatClass,CatID,Title,Description,Credits,PID,PREREQS,COREQS,FEES,Attribute
0,1,AN 0301,Independent Study,Students undertake an individualized program o...,1-3 Credits,1,None,None,None,None
1,2,AN 0310,Asian Studies Seminar,This seminar examines selected topics concerni...,3 Credits,1,None,None,None,None
2,3,BU 0211,Legal Environment of Business,This course examines the broad philosophical a...,3 Credits,2,Junior standing.,None,None,None
3,4,BU 0211,Legal Environment of Business,This course examines the broad philosophical a...,3 Credits,81,Junior standing.,None,None,None
4,5,BU 0220,Environmental Law and Policy,This course surveys issues arising out of fede...,3 Credits,2,None,None,None,"EVME Environmental Studies Major Elective, EVP..."

In [16]:
instructor = 'SELECT * FROM INSTRUCTOR;'
df3 = pd.read_sql(instructor, conn2)
df3.head()

   InID                Name
0     1   Michael P.  Coyne
1     2   Rebecca I.  Bloch
2     3       Paul   Caster
3     4  Jo Ann   Drusbosky
4     5   Arleen N.  Kardos

In [17]:
course_meeting = 'SELECT * FROM COURSE_MEETING'
df4 = pd.read_sql(course_meeting, conn2)
df4.head()

   MID    CRN      Term Location                Start                  End DAY
0    1  70384  Fall2014  DSB 105  2014-09-02T08:00:00  2014-09-02T09:15:00   T
1    2  70384  Fall2014  DSB 105  2014-09-05T08:00:00  2014-09-05T09:15:00   F
2    3  70384  Fall2014  DSB 105  2014-09-09T08:00:00  2014-09-09T09:15:00   T
3    4  70384  Fall2014  DSB 105  2014-09-12T08:00:00  2014-09-12T09:15:00   F
4    5  70384  Fall2014  DSB 105  2014-09-16T08:00:00  2014-09-16T09:15:00   T

In [18]:
location = 'SELECT Location FROM COURSE_MEETING'
df5 = pd.read_sql(location, conn2)
df5.head()

  Location
0  DSB 105
1  DSB 105
2  DSB 105
3  DSB 105
4  DSB 105

In [19]:
program = 'SELECT PName, Pcode FROM PROGRAM'
df6 = pd.read_sql(program, conn2)
df6.head()

            PName PCode
0   Asian Studies    AN
1        Business    BU
2   Black Studies    BL
3  Bioengineering   BEN
4          Arabic    AR

## Calculated Columns ##

In [20]:
# df calc columns
df['AvgCap'] = df["Cap"].mean()
df['MedCap'] = df['Cap'].median()
df.head()

,SID,CRN,Term,Section,Cap,Act,Rem,CatID,InID,AvgCap,MedCap
0,1,70384,Fall2014,C01,0,31,-31,AC 0011,1,17.710898,19.0
1,2,70385,Fall2014,C02,0,31,-31,AC 0011,1,17.710898,19.0
2,3,70382,Fall2014,C03,0,31,-31,AC 0011,1,17.710898,19.0
3,4,70291,Fall2014,C04,0,29,-29,AC 0011,2,17.710898,19.0
4,5,70350,Fall2014,C05,0,30,-30,AC 0011,2,17.710898,19.0

In [21]:
df['CountCRN'] = df4.CRN.nunique()
df['CountLocation'] = df4.Location.nunique()
df.head()

,SID,CRN,Term,Section,Cap,Act,Rem,CatID,InID,AvgCap,MedCap,CountCRN,CountLocation
0,1,70384,Fall2014,C01,0,31,-31,AC 0011,1,17.710898,19.0,11291,207
1,2,70385,Fall2014,C02,0,31,-31,AC 0011,1,17.710898,19.0,11291,207
2,3,70382,Fall2014,C03,0,31,-31,AC 0011,1,17.710898,19.0,11291,207
3,4,70291,Fall2014,C04,0,29,-29,AC 0011,2,17.710898,19.0,11291,207
4,5,70350,Fall2014,C05,0,30,-30,AC 0011,2,17.710898,19.0,11291,207

In [22]:
df.to_sql('COURSE', conn, if_exists='append', index=False)

In [23]:
df3.to_sql('INSTRUCTOR', conn, if_exists='append', index=False)

In [24]:
df4.to_sql('MEETING', conn, if_exists='append', index=False)

In [25]:
df6.to_sql('PROGRAM', conn, if_exists='append', index=False)

In [26]:
df2.to_sql('CATALOG', conn, if_exists='append', index=False)

In [27]:
df5.to_sql('LOCATION', conn, if_exists='append', index=False)